Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Constructor (List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the CylindricalSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CylindricalSurface(
	List<Point> lateralBoundary1,
	List<Point> lateralBoundary2,
	Line centerLine,
	Vector rotationAxis
)
Public Sub New (
	lateralBoundary1 As List(Of Point),
	lateralBoundary2 As List(Of Point),
	centerLine As Line,
	rotationAxis As Vector
)
Parameters
lateralBoundary1
Type: System.Collections.Generic.List<Point>
The first lateral boundary.
lateralBoundary2
Type: System.Collections.Generic.List<Point>
The second lateral boundary
centerLine
Type: Tekla.Structures.Geometry3d.Line
The center line of the cone/cylinder
rotationAxis
Type: Tekla.Structures.Geometry3d.Vector
 A vector normal to the circular cross sections of the cylinder. It defines the rotation axis from the start of a lateral boundary to the end of the same lateral boundary, according to the right hand rule.
See Also
Reference
CylindricalSurface Class
CylindricalSurface Overload
Tekla.Structures.Model Namespace